rails_task/task/app/controllers/marks_controller.rb

SELECT "marks".* FROM "marks" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
---
    def index
      @marks = Mark.offset(@page * @DATAS_PER_PAGE).limit(@DATAS_PER_PAGE)

INSERT INTO "marks" ("marks", "created_at", "updated_at", "student_id") VALUES (?, ?, ?, ?)  [["marks", "100"], ["created_at", "2021-01-21 06:02:39.269934"], ["updated_at", "2021-01-21 06:02:39.269934"], ["student_id", 8]]
---
    def create
        @mark = Mark.new(mark_params)
        respond_to do |format|
            if @mark.save

UPDATE "marks" SET "marks" = ?, "updated_at" = ? WHERE "marks"."id" = ?  [["marks", "67"], ["updated_at", "2021-01-18 20:16:45.707645"], ["id", 1]]
---
    def update

      respond_to do |format|
            if @mark.update(mark_params)

DELETE FROM "marks" WHERE "marks"."id" = ?  [["id", 1]]
---
    def destroy
        @mark.destroy

SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_mark
      @mark = Mark.find(params[:id])