rails_task/task/app/controllers/pages_controller.rb

    def search
        if params[:search].blank?
            redirect_to(root_path, notice: "Empty keyword") && return
        else
            @parameter = params[:search]
            # @results = Student.all.where("lower(first_name) LIKE :search", search: "%#{@parameter}%")
            @results = Mark.joins(:student).offset(@page * @DATAS_PER_PAGE).limit(@DATAS_PER_PAGE).search(params[:search])
---
SELECT "marks".* FROM "marks" INNER JOIN "students" ON "students"."id" = "marks"."student_id" WHERE (lower(students.first_name) LIKE 'ajai%' OR lower(students.age) LIKE 'ajai%' OR lower(students.phone) LIKE 'ajai%' OR lower(students.email) LIKE 'ajai%' OR lower(marks.marks) LIKE 'ajai%') LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]