rails_task/task/app/controllers/students_controller.rb

SELECT "students".* FROM "students" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
---
    def index
      @students = Student.limit(@DATAS_PER_PAGE).offset(@page * @DATAS_PER_PAGE)

INSERT INTO "students" ("first_name", "last_name", "age", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @student = Student.new(student_params)
        respond_to do |format|
            if @student.save

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "ajai"], ["updated_at", "2021-01-29 16:01:59.102182"], ["id", 25]]
---
    def update
        respond_to do |format|
            if @student.update(student_params)