rails_task/task/app/models/mark.rb

    def self.search(search)
        where("lower(students.first_name) LIKE :search OR lower(students.age) LIKE :search OR lower(students.phone) LIKE :search OR lower(students.email) LIKE :search OR lower(marks.marks) LIKE :search", search: "#{search.downcase}%").uniq
---
SELECT "marks".* FROM "marks" INNER JOIN "students" ON "students"."id" = "marks"."student_id" WHERE (lower(students.first_name) LIKE 'ajai%' OR lower(students.age) LIKE 'ajai%' OR lower(students.phone) LIKE 'ajai%' OR lower(students.email) LIKE 'ajai%' OR lower(marks.marks) LIKE 'ajai%') LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]