rails_task/task/app/views/pages/search.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
                <tr>
                    <td><%= link_to result.student.first_name + " " +  result.student.last_name, result.student%></td>